app/views/pages/index.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "albums" WHERE "albums"."user_id" = ?  [["user_id", 1]]
---
                    <div class="info-detail">
                        <a href="#"><%= current_user.photos.size %> <span>PHOTOS</span></a> |
                        <a href="#"><%= current_user.albums.size %> <span>ALBUMS</span></a> |