app/views/photos/index.html.erb

                                     <div class="user-name d-flex">
                                         <div class="user-icon d-flex justify-content-center"><%= photo.user.firstname[0] %><%= photo.user.lastname[0] %></div>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]