app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "description", "mode", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Album 1"], ["description", "Album 1"], ["mode", 0], ["user_id", 1], ["created_at", "2021-08-18 08:03:38.035239"], ["updated_at", "2021-08-18 08:03:38.035239"]]
---
    def create
        params[:album][:mode] = params[:album][:mode].to_i
        @album = current_user.albums.new(album_params)
        if @album.save