app/controllers/pages_controller.rb

    def index
        @photos = current_user.photos.all
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]