app/controllers/photos_controller.rb

    def index
        @photos = Photo.where(mode: "public_mode")
---
SELECT "photos".* FROM "photos" WHERE "photos"."mode" = ?  [["mode", 0]]

    def create
        params[:photo][:mode] = params[:photo][:mode].to_i
        @photo = current_user.photos.new(photo_params)
        if @photo.save
---
INSERT INTO "photos" ("title", "description", "image", "mode", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        params[:photo][:mode] = params[:photo][:mode].to_i
       if @photo.update(photo_params)
---
UPDATE "photos" SET "title" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["title", "Sua anh 1ddfdfsdf"], ["updated_at", "2021-08-19 06:46:07.729828"], ["id", 6]]

    def destroy
        if @photo.destroy
---
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 4]]

        def get_photo
            @photo = current_user.photos.find(params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ? AND "photos"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]